// 19. Напишите программу, которая 
// 1. принимает на вход пятизначное число и 
// 2. проверяет, является ли оно палиндромом.
// 14212 -> нет.
// 23432 -> да.
// 12821 -> да.

bool fifthsDigit (int number)

if (number > 9999 && number < 100000)
    { 
        return true
    }
    Console.WriteLine("число не пятизначное");
    return false

bool ValidatePalindrome(int num)
{
    int firstDigit == int fifthDigit;
    int secondDigit == int fourthDigit ;
    return IsPalindrom(int number);
}

int firstDigit = number % 10000;
int secondDigit = number % 10000 + 1;
int result = FirstDigit == FourthDigit && SecondDigit == FifthDigit
int number = GetUserInput("Введите пятизначное число: ");

bool palindrom = Palindrom(number)  
Console.WriteLine(IsPalindrome ? "true" : "false");